app/controllers/runs_controller.rb

SELECT "runs".* FROM "runs"
---
  def index
    @runs = Run.all

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @run = Run.find(params["id"])

INSERT INTO "runs" ("name", "date", "city", "distance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bieg Nocny"], ["date", "2016-05-14"], ["city", "Kraków"], ["distance", 10.0], ["created_at", "2016-04-16 12:49:44.949792"], ["updated_at", "2016-04-16 12:49:44.949792"]]
---
  def create
    run_params = params["run"].permit("name", "date", "city", "distance")
    run = Run.create(run_params)

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @run = Run.find(params["id"])

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "runs" SET "name" = ?, "date" = ?, "distance" = ?, "updated_at" = ? WHERE "runs"."id" = ?  [["name", "Półmaraton"], ["date", "2016-09-18"], ["distance", 21.0], ["updated_at", "2016-04-16 12:52:02.549170"], ["id", 2]]
---
  def update
    run_params = params["run"].permit("name", "date", "city", "distance")
    run = Run.find(params["id"])
    run.update(run_params)

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "runs" WHERE "runs"."id" = ?  [["id", 1]]
---
  def destroy
    run = Run.find(params['id'])
    run.destroy