app/controllers/users_controller.rb

  def create
    user_params = params["user"].permit("first_name", "last_name", "username", "password")
    user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "aa"], ["last_name", "bb"], ["username", "cc"], ["password", "dd"], ["created_at", "2016-04-16 12:42:59.426066"], ["updated_at", "2016-04-16 12:42:59.426066"]]